//----------------------------------------
#include "SettingsDialog.h"
#include "ui_SettingsDialog.h"
//----------------------------------------

/*!
 * \brief Сохранение конфигурации страницы "Общее"
 */
void SettingsDialog::saveConfigPageCommon() {

    m_config.m_tray = ui->trayCheck->isChecked();
}
//----------------------------------------------------------------------------------------------------------

/*!
 * \brief Восстановление конфигурации страницы "Общее"
 */
void SettingsDialog::restoreConfigPageCommon() {

    ui->trayCheck->setChecked( m_config.m_tray );
}
//----------------------------------------------------------------------------------------------------------

/*!
 * \brief Инициализация страницы "Общее"
 */
void SettingsDialog::initPageCommon() {
}
//----------------------------------------------------------------------------------------------------------
